benchmark/write-to-s3/lambda.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking hash.execute-api.eu-central-1.amazonaws.com (be patient)
Completed 1500 requests
Completed 3000 requests
Completed 4500 requests
Completed 6000 requests
Completed 7500 requests
Completed 9000 requests
Completed 10500 requests
Completed 12000 requests
Completed 13500 requests
Completed 15000 requests
Finished 15000 requests


Server Software:        
Server Hostname:        hash.execute-api.eu-central-1.amazonaws.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        hash.execute-api.eu-central-1.amazonaws.com

Document Path:          /Prod/invoke-lambda/
Document Length:        0 bytes

Concurrency Level:      1
Time taken for tests:   2264.357 seconds
Complete requests:      15000
Failed requests:        0
Total transferred:      7080000 bytes
HTML transferred:       0 bytes
Requests per second:    6.62 [#/sec] (mean)
Time per request:       150.957 [ms] (mean)
Time per request:       150.957 [ms] (mean, across all concurrent requests)
Transfer rate:          3.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       31   44  22.1     41    1303
Processing:    55  107  40.0     99    1641
Waiting:       54  106  40.0     98    1641
Total:         90  151  47.0    141    1679

Percentage of the requests served within a certain time (ms)
  50%    141
  66%    149
  75%    156
  80%    161
  90%    181
  95%    209
  98%    272
  99%    340
 100%   1679 (longest request)